																/* VALORANT V9.03*/
																/* QQ 1787174068  */
																/* QQ 2278616922*/
// ScriptStruct  NetCore.FastArraySerializerItem
// Struct Size::0x000C
struct FFastArraySerializerItem
{
    int32_t                                       ReplicationID;                                                // 0x0000(0x0004)
    int32_t                                       ReplicationKey;                                               // 0x0004(0x0004)
    int32_t                                       MostRecentArrayReplicationKey;                                // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.Default
// Struct Size::0x0000
struct FDefault
{
};


// ScriptStruct  GameplayAbilities.ActiveGameplayEffect
// Struct Size::0x0378
struct FActiveGameplayEffect : public FFastArraySerializerItem
{
    char                                          pa_000C[0x000C]                                               // 0x000C(0x000C)
    FGameplayEffectSpec                           Spec;                                                         // 0x0018(0x0298)
    FPredictionKey                                PredictionKey;                                                // 0x02B0(0x0018)
    float                                         StartServerWorldTime;                                         // 0x02C8(0x0004)
    float                                         CachedStartServerWorldTime;                                   // 0x02CC(0x0004)
    float                                         StartWorldTime;                                               // 0x02D0(0x0004)
    float                                         AdditionalDuration;                                           // 0x02D4(0x0004)
    float                                         ShowingAdditionalDuration;                                    // 0x02D8(0x0004)
    float                                         CachedAdditionalDuration;                                     // 0x02DC(0x0004)
    bool                                          bIsInhibited;                                                 // 0x02E0(0x0001)
    char                                          pa_02E1[0x0097]                                               // 0x02E1(0x0097)
};


// ScriptStruct  GameplayAbilities.PredictionKey
// Struct Size::0x0018
struct FPredictionKey
{
    UPackageMap*                                  PredictiveConnection;                                         // 0x0000(0x0008)
    int16_t                                       Current;                                                      // 0x0008(0x0002)
    int16_t                                       Base;                                                         // 0x000A(0x0002)
    bool                                          bIsStale;                                                     // 0x000C(0x0001)
    bool                                          bIsServerInitiated;                                           // 0x000D(0x0001)
    char                                          pa_000E[0x000A]                                               // 0x000E(0x000A)
};


// ScriptStruct  CoreUObject.ARFilter
// Struct Size::0x0150
struct FARFilter
{
    TArray<FName>                                 PackageNames;                                                 // 0x0000(0x0010)
    TArray<FName>                                 PackagePaths;                                                 // 0x0010(0x0010)
    TArray<FSoftObjectPath>                       SoftObjectPaths;                                              // 0x0020(0x0010)
    TArray<FName>                                 ClassNames;                                                   // 0x0030(0x0010)
    TArray<FTopLevelAssetPath>                    ClassPaths;                                                   // 0x0040(0x0010)
    char                                          pa_0050[0x0050]                                               // 0x0050(0x0050)
    TSet<FName>                                   RecursiveClassesExclusionSet;                                 // 0x00A0(0x0050)
    TSet<FTopLevelAssetPath>                      RecursiveClassPathsExclusionSet;                              // 0x00F0(0x0050)
    bool                                          bRecursivePaths;                                              // 0x0140(0x0001)
    bool                                          bRecursiveClasses;                                            // 0x0141(0x0001)
    bool                                          bIncludeOnlyOnDiskAssets;                                     // 0x0142(0x0001)
    char                                          pa_0143[0x000D]                                               // 0x0143(0x000D)
};


// ScriptStruct  CoreUObject.TopLevelAssetPath
// Struct Size::0x0010
struct FTopLevelAssetPath
{
    FName                                         PackageName;                                                  // 0x0000(0x0008)
    FName                                         AssetName;                                                    // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.SoftObjectPath
// Struct Size::0x0020
struct FSoftObjectPath
{
    FTopLevelAssetPath                            AssetPath;                                                    // 0x0000(0x0010)
    FString                                       SubPathString;                                                // 0x0010(0x0010)
};


// ScriptStruct  CoreUObject.AssetBundleData
// Struct Size::0x0010
struct FAssetBundleData
{
    TArray<FAssetBundleEntry>                     Bundles;                                                      // 0x0000(0x0010)
};


// ScriptStruct  CoreUObject.AssetBundleEntry
// Struct Size::0x0018
struct FAssetBundleEntry
{
    FName                                         BundleName;                                                   // 0x0000(0x0008)
    TArray<FTopLevelAssetPath>                    AssetPaths;                                                   // 0x0008(0x0010)
};


// ScriptStruct  CoreUObject.AssetData
// Struct Size::0x0068
struct FAssetData
{
    FName                                         PackageName;                                                  // 0x0000(0x0008)
    FName                                         PackagePath;                                                  // 0x0008(0x0008)
    FName                                         AssetName;                                                    // 0x0010(0x0008)
    FName                                         AssetClass;                                                   // 0x0018(0x0008)
    FTopLevelAssetPath                            AssetClassPath;                                               // 0x0020(0x0010)
    char                                          pa_0030[0x0038]                                               // 0x0030(0x0038)
};


// ScriptStruct  CoreUObject.AutomationEvent
// Struct Size::0x0038
struct FAutomationEvent
{
    enum class EAutomationEventType               Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0007]                                               // 0x0001(0x0007)
    FString                                       Message;                                                      // 0x0008(0x0010)
    FString                                       Context;                                                      // 0x0018(0x0010)
    FGuid                                         Artifact;                                                     // 0x0028(0x0010)
};


// ScriptStruct  CoreUObject.Guid
// Struct Size::0x0010
struct FGuid
{
    int32_t                                       A;                                                            // 0x0000(0x0004)
    int32_t                                       B;                                                            // 0x0004(0x0004)
    int32_t                                       C;                                                            // 0x0008(0x0004)
    int32_t                                       D;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.AutomationExecutionEntry
// Struct Size::0x0058
struct FAutomationExecutionEntry
{
    FAutomationEvent                              Event;                                                        // 0x0000(0x0038)
    FString                                       Filename;                                                     // 0x0038(0x0010)
    int32_t                                       LineNumber;                                                   // 0x0048(0x0004)
    char                                          pa_004C[0x0004]                                               // 0x004C(0x0004)
    FDateTime                                     Timestamp;                                                    // 0x0050(0x0008)
};


// ScriptStruct  CoreUObject.DateTime
// Struct Size::0x0008
struct FDateTime
{
    char                                          pa_0000[0x0008]                                               // 0x0000(0x0008)
};


// ScriptStruct  CoreUObject.Box
// Struct Size::0x0038
struct FBox
{
    FVector                                       Min;                                                          // 0x0000(0x0018)
    FVector                                       Max;                                                          // 0x0018(0x0018)
    char                                          IsValid;                                                      // 0x0030(0x0001)
    char                                          pa_0031[0x0007]                                               // 0x0031(0x0007)
};


// ScriptStruct  CoreUObject.Vector
// Struct Size::0x0018
struct FVector
{
    double                                        X;                                                            // 0x0000(0x0008)
    double                                        Y;                                                            // 0x0008(0x0008)
    double                                        Z;                                                            // 0x0010(0x0008)
};


// ScriptStruct  CoreUObject.Box2D
// Struct Size::0x0028
struct FBox2D
{
    FVector2D                                     Min;                                                          // 0x0000(0x0010)
    FVector2D                                     Max;                                                          // 0x0010(0x0010)
    char                                          bIsValid;                                                     // 0x0020(0x0001)
    char                                          pa_0021[0x0007]                                               // 0x0021(0x0007)
};


// ScriptStruct  CoreUObject.Vector2D
// Struct Size::0x0010
struct FVector2D
{
    double                                        X;                                                            // 0x0000(0x0008)
    double                                        Y;                                                            // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Box2f
// Struct Size::0x0014
struct FBox2f
{
    FVector2f                                     Min;                                                          // 0x0000(0x0008)
    FVector2f                                     Max;                                                          // 0x0008(0x0008)
    char                                          bIsValid;                                                     // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
};


// ScriptStruct  CoreUObject.Vector2f
// Struct Size::0x0008
struct FVector2f
{
    float                                         X;                                                            // 0x0000(0x0004)
    float                                         Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Box3d
// Struct Size::0x0038
struct FBox3d
{
    FVector3d                                     Min;                                                          // 0x0000(0x0018)
    FVector3d                                     Max;                                                          // 0x0018(0x0018)
    char                                          IsValid;                                                      // 0x0030(0x0001)
    char                                          pa_0031[0x0007]                                               // 0x0031(0x0007)
};


// ScriptStruct  CoreUObject.Vector3d
// Struct Size::0x0018
struct FVector3d
{
    double                                        X;                                                            // 0x0000(0x0008)
    double                                        Y;                                                            // 0x0008(0x0008)
    double                                        Z;                                                            // 0x0010(0x0008)
};


// ScriptStruct  CoreUObject.Box3f
// Struct Size::0x001C
struct FBox3f
{
    FVector3f                                     Min;                                                          // 0x0000(0x000C)
    FVector3f                                     Max;                                                          // 0x000C(0x000C)
    char                                          IsValid;                                                      // 0x0018(0x0001)
    char                                          pa_0019[0x0003]                                               // 0x0019(0x0003)
};


// ScriptStruct  CoreUObject.Vector3f
// Struct Size::0x000C
struct FVector3f
{
    float                                         X;                                                            // 0x0000(0x0004)
    float                                         Y;                                                            // 0x0004(0x0004)
    float                                         Z;                                                            // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.BoxSphereBounds
// Struct Size::0x0038
struct FBoxSphereBounds
{
    FVector                                       Origin;                                                       // 0x0000(0x0018)
    FVector                                       BoxExtent;                                                    // 0x0018(0x0018)
    double                                        SphereRadius;                                                 // 0x0030(0x0008)
};


// ScriptStruct  CoreUObject.BoxSphereBounds3d
// Struct Size::0x0038
struct FBoxSphereBounds3d
{
    FVector3d                                     Origin;                                                       // 0x0000(0x0018)
    FVector3d                                     BoxExtent;                                                    // 0x0018(0x0018)
    double                                        SphereRadius;                                                 // 0x0030(0x0008)
};


// ScriptStruct  CoreUObject.BoxSphereBounds3f
// Struct Size::0x001C
struct FBoxSphereBounds3f
{
    FVector3f                                     Origin;                                                       // 0x0000(0x000C)
    FVector3f                                     BoxExtent;                                                    // 0x000C(0x000C)
    float                                         SphereRadius;                                                 // 0x0018(0x0004)
};


// ScriptStruct  CoreUObject.Color
// Struct Size::0x0004
struct FColor
{
    char                                          B;                                                            // 0x0000(0x0001)
    char                                          G;                                                            // 0x0001(0x0001)
    char                                          R;                                                            // 0x0002(0x0001)
    char                                          A;                                                            // 0x0003(0x0001)
};


// ScriptStruct  CoreUObject.DirectoryPath
// Struct Size::0x0010
struct FDirectoryPath
{
    FString                                       Path;                                                         // 0x0000(0x0010)
};


// ScriptStruct  CoreUObject.DoubleRange
// Struct Size::0x0020
struct FDoubleRange
{
    FDoubleRangeBound                             LowerBound;                                                   // 0x0000(0x0010)
    FDoubleRangeBound                             UpperBound;                                                   // 0x0010(0x0010)
};


// ScriptStruct  CoreUObject.DoubleRangeBound
// Struct Size::0x0010
struct FDoubleRangeBound
{
    enum class ERangeBoundTypes                   Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0007]                                               // 0x0001(0x0007)
    double                                        Value;                                                        // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.FallbackStruct
// Struct Size::0x0001
struct FFallbackStruct
{
    char                                          pa_0000[0x0001]                                               // 0x0000(0x0001)
};


// ScriptStruct  CoreUObject.FilePath
// Struct Size::0x0010
struct FFilePath
{
    FString                                       FilePath;                                                     // 0x0000(0x0010)
};


// ScriptStruct  CoreUObject.FloatInterval
// Struct Size::0x0008
struct FFloatInterval
{
    float                                         Min;                                                          // 0x0000(0x0004)
    float                                         Max;                                                          // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.FloatRange
// Struct Size::0x0010
struct FFloatRange
{
    FFloatRangeBound                              LowerBound;                                                   // 0x0000(0x0008)
    FFloatRangeBound                              UpperBound;                                                   // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.FloatRangeBound
// Struct Size::0x0008
struct FFloatRangeBound
{
    enum class ERangeBoundTypes                   Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0003]                                               // 0x0001(0x0003)
    float                                         Value;                                                        // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.FrameNumber
// Struct Size::0x0004
struct FFrameNumber
{
    int32_t                                       Value;                                                        // 0x0000(0x0004)
};


// ScriptStruct  CoreUObject.FrameNumberRange
// Struct Size::0x0010
struct FFrameNumberRange
{
    FFrameNumberRangeBound                        LowerBound;                                                   // 0x0000(0x0008)
    FFrameNumberRangeBound                        UpperBound;                                                   // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.FrameNumberRangeBound
// Struct Size::0x0008
struct FFrameNumberRangeBound
{
    enum class ERangeBoundTypes                   Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0003]                                               // 0x0001(0x0003)
    FFrameNumber                                  Value;                                                        // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.FrameRate
// Struct Size::0x0008
struct FFrameRate
{
    int32_t                                       Numerator;                                                    // 0x0000(0x0004)
    int32_t                                       Denominator;                                                  // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.FrameTime
// Struct Size::0x0008
struct FFrameTime
{
    FFrameNumber                                  FrameNumber;                                                  // 0x0000(0x0004)
    float                                         SubFrame;                                                     // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.InputDeviceId
// Struct Size::0x0004
struct FInputDeviceId
{
    int32_t                                       InternalId;                                                   // 0x0000(0x0004)
};


// ScriptStruct  CoreUObject.Int32Interval
// Struct Size::0x0008
struct FInt32Interval
{
    int32_t                                       Min;                                                          // 0x0000(0x0004)
    int32_t                                       Max;                                                          // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Int32Point
// Struct Size::0x0008
struct FInt32Point
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Int32Range
// Struct Size::0x0010
struct FInt32Range
{
    FInt32RangeBound                              LowerBound;                                                   // 0x0000(0x0008)
    FInt32RangeBound                              UpperBound;                                                   // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Int32RangeBound
// Struct Size::0x0008
struct FInt32RangeBound
{
    enum class ERangeBoundTypes                   Type;                                                         // 0x0000(0x0001)
    char                                          pa_0001[0x0003]                                               // 0x0001(0x0003)
    int32_t                                       Value;                                                        // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Int32Vector
// Struct Size::0x000C
struct FInt32Vector
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
    int32_t                                       Z;                                                            // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.Int32Vector2
// Struct Size::0x0008
struct FInt32Vector2
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Int32Vector4
// Struct Size::0x0010
struct FInt32Vector4
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
    int32_t                                       Z;                                                            // 0x0008(0x0004)
    int32_t                                       W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.Int64Point
// Struct Size::0x0010
struct FInt64Point
{
    int64_t                                       X;                                                            // 0x0000(0x0008)
    int64_t                                       Y;                                                            // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Int64Vector
// Struct Size::0x0018
struct FInt64Vector
{
    int64_t                                       X;                                                            // 0x0000(0x0008)
    int64_t                                       Y;                                                            // 0x0008(0x0008)
    int64_t                                       Z;                                                            // 0x0010(0x0008)
};


// ScriptStruct  CoreUObject.Int64Vector2
// Struct Size::0x0010
struct FInt64Vector2
{
    int64_t                                       X;                                                            // 0x0000(0x0008)
    int64_t                                       Y;                                                            // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Int64Vector4
// Struct Size::0x0020
struct FInt64Vector4
{
    int64_t                                       X;                                                            // 0x0000(0x0008)
    int64_t                                       Y;                                                            // 0x0008(0x0008)
    int64_t                                       Z;                                                            // 0x0010(0x0008)
    int64_t                                       W;                                                            // 0x0018(0x0008)
};


// ScriptStruct  CoreUObject.InterpCurveFloat
// Struct Size::0x0018
struct FInterpCurveFloat
{
    TArray<FInterpCurvePointFloat>                Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointFloat
// Struct Size::0x0014
struct FInterpCurvePointFloat
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    float                                         OutVal;                                                       // 0x0004(0x0004)
    float                                         ArriveTangent;                                                // 0x0008(0x0004)
    float                                         LeaveTangent;                                                 // 0x000C(0x0004)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
};


// ScriptStruct  CoreUObject.InterpCurveLinearColor
// Struct Size::0x0018
struct FInterpCurveLinearColor
{
    TArray<FInterpCurvePointLinearColor>          Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointLinearColor
// Struct Size::0x0038
struct FInterpCurvePointLinearColor
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    FLinearColor                                  OutVal;                                                       // 0x0004(0x0010)
    FLinearColor                                  ArriveTangent;                                                // 0x0014(0x0010)
    FLinearColor                                  LeaveTangent;                                                 // 0x0024(0x0010)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0034(0x0001)
    char                                          pa_0035[0x0003]                                               // 0x0035(0x0003)
};


// ScriptStruct  CoreUObject.LinearColor
// Struct Size::0x0010
struct FLinearColor
{
    float                                         R;                                                            // 0x0000(0x0004)
    float                                         G;                                                            // 0x0004(0x0004)
    float                                         B;                                                            // 0x0008(0x0004)
    float                                         A;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurvePointQuat
// Struct Size::0x0080
struct FInterpCurvePointQuat
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    char                                          pa_0004[0x000C]                                               // 0x0004(0x000C)
    FQuat                                         OutVal;                                                       // 0x0010(0x0020)
    FQuat                                         ArriveTangent;                                                // 0x0030(0x0020)
    FQuat                                         LeaveTangent;                                                 // 0x0050(0x0020)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0070(0x0001)
    char                                          pa_0071[0x000F]                                               // 0x0071(0x000F)
};


// ScriptStruct  CoreUObject.Quat
// Struct Size::0x0020
struct FQuat
{
    double                                        X;                                                            // 0x0000(0x0008)
    double                                        Y;                                                            // 0x0008(0x0008)
    double                                        Z;                                                            // 0x0010(0x0008)
    double                                        W;                                                            // 0x0018(0x0008)
};


// ScriptStruct  CoreUObject.InterpCurvePointTwoVectors
// Struct Size::0x00A0
struct FInterpCurvePointTwoVectors
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    char                                          pa_0004[0x0004]                                               // 0x0004(0x0004)
    FTwoVectors                                   OutVal;                                                       // 0x0008(0x0030)
    FTwoVectors                                   ArriveTangent;                                                // 0x0038(0x0030)
    FTwoVectors                                   LeaveTangent;                                                 // 0x0068(0x0030)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0098(0x0001)
    char                                          pa_0099[0x0007]                                               // 0x0099(0x0007)
};


// ScriptStruct  CoreUObject.TwoVectors
// Struct Size::0x0030
struct FTwoVectors
{
    FVector                                       v1;                                                           // 0x0000(0x0018)
    FVector                                       v2;                                                           // 0x0018(0x0018)
};


// ScriptStruct  CoreUObject.InterpCurvePointVector
// Struct Size::0x0058
struct FInterpCurvePointVector
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    char                                          pa_0004[0x0004]                                               // 0x0004(0x0004)
    FVector                                       OutVal;                                                       // 0x0008(0x0018)
    FVector                                       ArriveTangent;                                                // 0x0020(0x0018)
    FVector                                       LeaveTangent;                                                 // 0x0038(0x0018)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0050(0x0001)
    char                                          pa_0051[0x0007]                                               // 0x0051(0x0007)
};


// ScriptStruct  CoreUObject.InterpCurvePointVector2D
// Struct Size::0x0040
struct FInterpCurvePointVector2D
{
    float                                         InVal;                                                        // 0x0000(0x0004)
    char                                          pa_0004[0x0004]                                               // 0x0004(0x0004)
    FVector2D                                     OutVal;                                                       // 0x0008(0x0010)
    FVector2D                                     ArriveTangent;                                                // 0x0018(0x0010)
    FVector2D                                     LeaveTangent;                                                 // 0x0028(0x0010)
    enum class EInterpCurveMode                   InterpMode;                                                   // 0x0038(0x0001)
    char                                          pa_0039[0x0007]                                               // 0x0039(0x0007)
};


// ScriptStruct  CoreUObject.InterpCurveQuat
// Struct Size::0x0018
struct FInterpCurveQuat
{
    TArray<FInterpCurvePointQuat>                 Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurveTwoVectors
// Struct Size::0x0018
struct FInterpCurveTwoVectors
{
    TArray<FInterpCurvePointTwoVectors>           Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurveVector
// Struct Size::0x0018
struct FInterpCurveVector
{
    TArray<FInterpCurvePointVector>               Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.InterpCurveVector2D
// Struct Size::0x0018
struct FInterpCurveVector2D
{
    TArray<FInterpCurvePointVector2D>             Points;                                                       // 0x0000(0x0010)
    bool                                          bIsLooped;                                                    // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
    float                                         LoopKeyOffset;                                                // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.IntPoint
// Struct Size::0x0008
struct FIntPoint
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.IntVector
// Struct Size::0x000C
struct FIntVector
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
    int32_t                                       Z;                                                            // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.IntVector2
// Struct Size::0x0008
struct FIntVector2
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.IntVector4
// Struct Size::0x0010
struct FIntVector4
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
    int32_t                                       Z;                                                            // 0x0008(0x0004)
    int32_t                                       W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.Matrix
// Struct Size::0x0080
struct FMatrix
{
    FPlane                                        XPlane;                                                       // 0x0000(0x0020)
    FPlane                                        YPlane;                                                       // 0x0020(0x0020)
    FPlane                                        ZPlane;                                                       // 0x0040(0x0020)
    FPlane                                        WPlane;                                                       // 0x0060(0x0020)
};


// ScriptStruct  CoreUObject.Plane
// Struct Size::0x0020
struct FPlane : public FVector
{
    double                                        W;                                                            // 0x0018(0x0008)
};


// ScriptStruct  CoreUObject.Matrix44d
// Struct Size::0x0080
struct FMatrix44d
{
    FPlane4d                                      XPlane;                                                       // 0x0000(0x0020)
    FPlane4d                                      YPlane;                                                       // 0x0020(0x0020)
    FPlane4d                                      ZPlane;                                                       // 0x0040(0x0020)
    FPlane4d                                      WPlane;                                                       // 0x0060(0x0020)
};


// ScriptStruct  CoreUObject.Plane4d
// Struct Size::0x0020
struct FPlane4d : public FVector3d
{
    double                                        W;                                                            // 0x0018(0x0008)
};


// ScriptStruct  CoreUObject.Matrix44f
// Struct Size::0x0040
struct FMatrix44f
{
    FPlane4f                                      XPlane;                                                       // 0x0000(0x0010)
    FPlane4f                                      YPlane;                                                       // 0x0010(0x0010)
    FPlane4f                                      ZPlane;                                                       // 0x0020(0x0010)
    FPlane4f                                      WPlane;                                                       // 0x0030(0x0010)
};


// ScriptStruct  CoreUObject.Plane4f
// Struct Size::0x0010
struct FPlane4f : public FVector3f
{
    float                                         W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.OrientedBox
// Struct Size::0x0078
struct FOrientedBox
{
    FVector                                       Center;                                                       // 0x0000(0x0018)
    FVector                                       AxisX;                                                        // 0x0018(0x0018)
    FVector                                       AxisY;                                                        // 0x0030(0x0018)
    FVector                                       AxisZ;                                                        // 0x0048(0x0018)
    double                                        ExtentX;                                                      // 0x0060(0x0008)
    double                                        ExtentY;                                                      // 0x0068(0x0008)
    double                                        ExtentZ;                                                      // 0x0070(0x0008)
};


// ScriptStruct  CoreUObject.PackedNormal
// Struct Size::0x0004
struct FPackedNormal
{
    char                                          X;                                                            // 0x0000(0x0001)
    char                                          Y;                                                            // 0x0001(0x0001)
    char                                          Z;                                                            // 0x0002(0x0001)
    char                                          W;                                                            // 0x0003(0x0001)
};


// ScriptStruct  CoreUObject.PackedRGB10A2N
// Struct Size::0x0004
struct FPackedRGB10A2N
{
    int32_t                                       Packed;                                                       // 0x0000(0x0004)
};


// ScriptStruct  CoreUObject.PackedRGBA16N
// Struct Size::0x0008
struct FPackedRGBA16N
{
    int32_t                                       XY;                                                           // 0x0000(0x0004)
    int32_t                                       ZW;                                                           // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.PlatformInputDeviceState
// Struct Size::0x0008
struct FPlatformInputDeviceState
{
    FPlatformUserId                               OwningPlatformUser;                                           // 0x0000(0x0004)
    enum class EInputDeviceConnectionState        ConnectionState;                                              // 0x0004(0x0001)
    char                                          pa_0005[0x0003]                                               // 0x0005(0x0003)
};


// ScriptStruct  CoreUObject.PlatformUserId
// Struct Size::0x0004
struct FPlatformUserId
{
    int32_t                                       InternalId;                                                   // 0x0000(0x0004)
};


// ScriptStruct  CoreUObject.PolyglotTextData
// Struct Size::0x00B8
struct FPolyglotTextData
{
    enum class ELocalizedTextSourceCategory       Category;                                                     // 0x0000(0x0001)
    char                                          pa_0001[0x0007]                                               // 0x0001(0x0007)
    FString                                       NativeCulture;                                                // 0x0008(0x0010)
    FString                                       Namespace;                                                    // 0x0018(0x0010)
    FString                                       Key;                                                          // 0x0028(0x0010)
    FString                                       NativeString;                                                 // 0x0038(0x0010)
    TMap<FString,FString>                         LocalizedStrings;                                             // 0x0048(0x0050)
    bool                                          bIsMinimalPatch;                                              // 0x0098(0x0001)
    char                                          pa_0099[0x0007]                                               // 0x0099(0x0007)
    FText                                         CachedText;                                                   // 0x00A0(0x0018)
};


// ScriptStruct  CoreUObject.PrimaryAssetId
// Struct Size::0x0010
struct FPrimaryAssetId
{
    FPrimaryAssetType                             PrimaryAssetType;                                             // 0x0000(0x0008)
    FName                                         PrimaryAssetName;                                             // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.PrimaryAssetType
// Struct Size::0x0008
struct FPrimaryAssetType
{
    FName                                         Name;                                                         // 0x0000(0x0008)
};


// ScriptStruct  CoreUObject.QualifiedFrameTime
// Struct Size::0x0010
struct FQualifiedFrameTime
{
    FFrameTime                                    Time;                                                         // 0x0000(0x0008)
    FFrameRate                                    Rate;                                                         // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Quat4d
// Struct Size::0x0020
struct FQuat4d
{
    double                                        X;                                                            // 0x0000(0x0008)
    double                                        Y;                                                            // 0x0008(0x0008)
    double                                        Z;                                                            // 0x0010(0x0008)
    double                                        W;                                                            // 0x0018(0x0008)
};


// ScriptStruct  CoreUObject.Quat4f
// Struct Size::0x0010
struct FQuat4f
{
    float                                         X;                                                            // 0x0000(0x0004)
    float                                         Y;                                                            // 0x0004(0x0004)
    float                                         Z;                                                            // 0x0008(0x0004)
    float                                         W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.RandomStream
// Struct Size::0x0008
struct FRandomStream
{
    int32_t                                       InitialSeed;                                                  // 0x0000(0x0004)
    int32_t                                       Seed;                                                         // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Rotator
// Struct Size::0x0018
struct FRotator
{
    double                                        Pitch;                                                        // 0x0000(0x0008)
    double                                        Yaw;                                                          // 0x0008(0x0008)
    double                                        Roll;                                                         // 0x0010(0x0008)
};


// ScriptStruct  CoreUObject.Rotator3d
// Struct Size::0x0018
struct FRotator3d
{
    double                                        Pitch;                                                        // 0x0000(0x0008)
    double                                        Yaw;                                                          // 0x0008(0x0008)
    double                                        Roll;                                                         // 0x0010(0x0008)
};


// ScriptStruct  CoreUObject.Rotator3f
// Struct Size::0x000C
struct FRotator3f
{
    float                                         Pitch;                                                        // 0x0000(0x0004)
    float                                         Yaw;                                                          // 0x0004(0x0004)
    float                                         Roll;                                                         // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.SoftClassPath
// Struct Size::0x0020
struct FSoftClassPath : public FSoftObjectPath
{
};


// ScriptStruct  CoreUObject.TemplateString
// Struct Size::0x0010
struct FTemplateString
{
    FString                                       Template;                                                     // 0x0000(0x0010)
};


// ScriptStruct  CoreUObject.TestUninitializedScriptStructMembersTest
// Struct Size::0x0018
struct FTestUninitializedScriptStructMembersTest
{
    UObject*                                      UninitializedObjectReference;                                 // 0x0000(0x0008)
    UObject*                                      InitializedObjectReference;                                   // 0x0008(0x0008)
    float                                         UnusedValue;                                                  // 0x0010(0x0004)
    char                                          pa_0014[0x0004]                                               // 0x0014(0x0004)
};


// ScriptStruct  CoreUObject.Timecode
// Struct Size::0x0014
struct FTimecode
{
    int32_t                                       Hours;                                                        // 0x0000(0x0004)
    int32_t                                       Minutes;                                                      // 0x0004(0x0004)
    int32_t                                       Seconds;                                                      // 0x0008(0x0004)
    int32_t                                       Frames;                                                       // 0x000C(0x0004)
    bool                                          bDropFrameFormat;                                             // 0x0010(0x0001)
    char                                          pa_0011[0x0003]                                               // 0x0011(0x0003)
};


// ScriptStruct  CoreUObject.Timespan
// Struct Size::0x0008
struct FTimespan
{
    char                                          pa_0000[0x0008]                                               // 0x0000(0x0008)
};


// ScriptStruct  CoreUObject.Transform
// Struct Size::0x0060
struct FTransform
{
    FQuat                                         Rotation;                                                     // 0x0000(0x0020)
    FVector                                       Translation;                                                  // 0x0020(0x0018)
    char                                          pa_0038[0x0008]                                               // 0x0038(0x0008)
    FVector                                       Scale3D;                                                      // 0x0040(0x0018)
    char                                          pa_0058[0x0008]                                               // 0x0058(0x0008)
};


// ScriptStruct  CoreUObject.Transform3d
// Struct Size::0x0060
struct FTransform3d
{
    FQuat4d                                       Rotation;                                                     // 0x0000(0x0020)
    FVector3d                                     Translation;                                                  // 0x0020(0x0018)
    char                                          pa_0038[0x0008]                                               // 0x0038(0x0008)
    FVector3d                                     Scale3D;                                                      // 0x0040(0x0018)
    char                                          pa_0058[0x0008]                                               // 0x0058(0x0008)
};


// ScriptStruct  CoreUObject.Transform3f
// Struct Size::0x0030
struct FTransform3f
{
    FQuat4f                                       Rotation;                                                     // 0x0000(0x0010)
    FVector3f                                     Translation;                                                  // 0x0010(0x000C)
    char                                          pa_001C[0x0004]                                               // 0x001C(0x0004)
    FVector3f                                     Scale3D;                                                      // 0x0020(0x000C)
    char                                          pa_002C[0x0004]                                               // 0x002C(0x0004)
};


// ScriptStruct  CoreUObject.Uint32Point
// Struct Size::0x0008
struct FUint32Point
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Uint32Vector
// Struct Size::0x000C
struct FUint32Vector
{
    uint32_t                                      X;                                                            // 0x0000(0x0004)
    uint32_t                                      Y;                                                            // 0x0004(0x0004)
    uint32_t                                      Z;                                                            // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.Uint32Vector2
// Struct Size::0x0008
struct FUint32Vector2
{
    uint32_t                                      X;                                                            // 0x0000(0x0004)
    uint32_t                                      Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.Uint32Vector4
// Struct Size::0x0010
struct FUint32Vector4
{
    uint32_t                                      X;                                                            // 0x0000(0x0004)
    uint32_t                                      Y;                                                            // 0x0004(0x0004)
    uint32_t                                      Z;                                                            // 0x0008(0x0004)
    uint32_t                                      W;                                                            // 0x000C(0x0004)
};


// ScriptStruct  CoreUObject.Uint64Point
// Struct Size::0x0010
struct FUint64Point
{
    int64_t                                       X;                                                            // 0x0000(0x0008)
    int64_t                                       Y;                                                            // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Uint64Vector
// Struct Size::0x0018
struct FUint64Vector
{
    uint64_t                                      X;                                                            // 0x0000(0x0008)
    uint64_t                                      Y;                                                            // 0x0008(0x0008)
    uint64_t                                      Z;                                                            // 0x0010(0x0008)
};


// ScriptStruct  CoreUObject.Uint64Vector2
// Struct Size::0x0010
struct FUint64Vector2
{
    uint64_t                                      X;                                                            // 0x0000(0x0008)
    uint64_t                                      Y;                                                            // 0x0008(0x0008)
};


// ScriptStruct  CoreUObject.Uint64Vector4
// Struct Size::0x0020
struct FUint64Vector4
{
    uint64_t                                      X;                                                            // 0x0000(0x0008)
    uint64_t                                      Y;                                                            // 0x0008(0x0008)
    uint64_t                                      Z;                                                            // 0x0010(0x0008)
    uint64_t                                      W;                                                            // 0x0018(0x0008)
};


// ScriptStruct  CoreUObject.UintPoint
// Struct Size::0x0008
struct FUintPoint
{
    int32_t                                       X;                                                            // 0x0000(0x0004)
    int32_t                                       Y;                                                            // 0x0004(0x0004)
};


// ScriptStruct  CoreUObject.UintVector
// Struct Size::0x000C
struct FUintVector
{
    uint32_t                                      X;                                                            // 0x0000(0x0004)
    uint32_t                                      Y;                                                            // 0x0004(0x0004)
    uint32_t                                      Z;                                                            // 0x0008(0x0004)
};


// ScriptStruct  CoreUObject.UintVector2
// Struct Size::0x0008
struct FUintVector2
{
    uint32_t                                      X;                                                            // 0x0000(0x0004)
    uint32_t                                      Y;                                                            // 0x0004(0x0004)
};


